samiparyal/LandslideEWS_lowpow/STM32_BLE/App/app_ble.c
#include <stdio.h>
#include <string.h>
#include "main.h"
#include "stm32wb0x.h"
#include "ble.h"
#include "gatt_profile.h"
#include "gap_profile.h"
#include "app_ble.h"
#include "stm32wb0x_hal_radio_timer.h"
#include "bleplat.h"
#include "nvm_db.h"
#include "blenvm.h"
#include "pka_manager.h"
#include "stm32_seq.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "landslide_service.h"
#include "imu.h"
#include "SEGGER_RTT.h"
#include "stm32_lpm.h"
#include "tilt_detector.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */

/* USER CODE END PTD */

/**
 * Security parameters structure
 */
typedef struct
{
  uint8_t ioCapability;
  uint8_t mitm_mode;
  uint8_t bonding_mode;
  uint8_t encryptionKeySizeMin;
  uint8_t encryptionKeySizeMax;
  uint8_t initiateSecurity;
  /* USER CODE BEGIN tSecurityParams*/

  /* USER CODE END tSecurityParams */
}SecurityParams_t;

/**
 * Global context contains all BLE common variables.
 */
typedef struct
{
  SecurityParams_t bleSecurityParam;
  uint16_t gapServiceHandle;
  uint16_t devNameCharHandle;
  uint16_t appearanceCharHandle;
  uint16_t connectionHandle;
  /* USER CODE BEGIN BleGlobalContext_t*/

  /* USER CODE END BleGlobalContext_t */
}BleGlobalContext_t;

typedef struct
{
  BleGlobalContext_t BleApplicationContext_legacy;
  APP_BLE_ConnStatus_t Device_Connection_Status;
  /* USER CODE BEGIN PTD_1*/

  /* USER CODE END PTD_1 */
}BleApplicationContext_t;

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */

/* USER CODE END PD */
/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */
/* USER CODE END PM */


NO_INIT(uint32_t dyn_alloc_a[BLE_DYN_ALLOC_SIZE>>2]);

static BleApplicationContext_t bleAppCtx;

static const char a_GapDeviceName[] = {  'S', 'T', 'M', '3', '2', 'W', 'B', '0' }; /* Gap Device Name */

/**
 * Advertising Data
 */
uint8_t a_AdvData[] =
{
  2, AD_TYPE_FLAGS, FLAG_BIT_BR_EDR_NOT_SUPPORTED,
  14, AD_TYPE_COMPLETE_LOCAL_NAME, 'L', 'A', 'N', 'D', 'S', 'L', 'I', 'D', 'E', '_', 'E', 'W', 'S',  /* Complete name */

  3, AD_TYPE_16_BIT_SERV_UUID_CMPLT_LIST,
  0x01, 0xFF, //service uuid - 0xFF01

  /* Manufacturer Specific Data (0xFF)
     length + 1(type) + 2(company id) + 1(alarm) + f2(counter) + 1(src) = 7
  */
  7, 0xFF,
  0xFF, 0xFF,   /* company id (demo) */
  0x00,         /* alarm */
  0x00,      /* vel */
  0x00,          /* dph */
  0x00

};

/* USER CODE BEGIN PV */

/* Devices allowed to connect --- [[[[[ UNCOMMENT ON PROD ]]]]] */
typedef struct {
	uint8_t address_type;
	uint8_t address[6];
} AcceptedDevice_t;

static const List_Entry_t s_accepted_devices[] = {
	{ 0x01, { 0x47, 0x4C, 0x53, 0x54, 0x52, 0xC0 }},   // Gateway - ASCII for RTSLG
};

#define NUM_ACCEPTED_DEVICES (sizeof(s_accepted_devices)/sizeof(s_accepted_devices[0]))

static VTIMER_HandleType AlertTimerHandle;

/* Two sampling architectures, selected by TRAINING_MODE_ENABLED:
 *
 *   TRAINING (=1): IMU DRDY interrupt drives sampling. Survives the fast rates
 *                  that made virtual timers contend with the radio scheduler
 *                  and freeze. Power is irrelevant on the bench.
 *
 *   PRODUCTION (=0): virtual timers drive sampling and sending, at exactly the
 *                  POLL_INTERVAL_* / BROADCAST_* values. This is the only
 *                  configuration that reaches the DEEPSTOP floor (~130 uA);
 *                  with no virtual timer armed the radio-timer driver refuses
 *                  deep sleep and sits at ~1.7 mA. INT1/PB9 stays analog here.
 */
#if !TRAINING_MODE_ENABLED
static VTIMER_HandleType TiltPollTimerHandle;
static VTIMER_HandleType RawImuTimerHandle;
static void APP_BLE_TiltPollTimer_Callback(void *context);
static void APP_BLE_RawImuTimer_Callback(void *context);
static uint32_t APP_BLE_BroadcastIntervalMs(void);
#endif
static uint8_t g_in_alert_mode = 0;


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout);

static void gap_cmd_resp_wait(void);
static void gap_cmd_resp_release(void);

/* USER CODE BEGIN PFP */
static void APP_BLE_TiltPoll_Task(void);

/* USER CODE END PFP */

/* External variables --------------------------------------------------------*/

/* USER CODE BEGIN EV */

/* USER CODE END EV */

/* Private functions ---------------------------------------------------------*/

/* USER CODE BEGIN PF */
#if !TRAINING_MODE_ENABLED
/* Send cadence per state, used to re-arm RawImuTimerHandle. */
static uint32_t APP_BLE_BroadcastIntervalMs(void)
{
    switch (tilt_detector_get_state())
    {
        case TILT_STATE_CRITICAL:    return BROADCAST_CRITICAL_MS;
        case TILT_STATE_WARNING:     return BROADCAST_WARNING_MS;
        case TILT_STATE_CALIBRATING: return POLL_INTERVAL_CALIB_MS;
        default:                     return BROADCAST_NORMAL_MS;
    }
}

static void APP_BLE_TiltPollTimer_Callback(void *context)
{
    (void)context;
    /* Re-armed by APP_BLE_TiltPoll_Task, which knows the resulting state. */
    UTIL_SEQ_SetTask(1U << CFG_TASK_TILT_POLL_ID, CFG_SEQ_PRIO_1);
}

static void APP_BLE_RawImuTimer_Callback(void *context)
{
    (void)context;
    UTIL_SEQ_SetTask(1U << CFG_TASK_RAW_IMU_SEND_ID, CFG_SEQ_PRIO_1);
    HAL_RADIO_TIMER_StartVirtualTimer(&RawImuTimerHandle, APP_BLE_BroadcastIntervalMs());
}
#endif

/* No rate gating here: in production the RawImu vtimer already fires at the
   BROADCAST_* cadence, and in training every DRDY edge should be sent. */
static void APP_BLE_RawImuSend_Task(void)
{
    (void)Landslide_Send_Next_Pending();
}
/* USER CODE END PF */

/* Functions Definition ------------------------------------------------------*/
void ModulesInit(void)
{
  BLENVM_Init();
  if (PKAMGR_Init() == PKAMGR_ERROR)
  {
    Error_Handler();
  }
}

