samiparyal/LandslideEWS_lowpow/STM32_BLE/App/app_ble.c
  case HCI_VENDOR_EVT_CODE:
    {
      aci_blecore_event *p_blecore_evt = (aci_blecore_event*) event_data;
      switch (p_blecore_evt->ecode)
      {
      case ACI_L2CAP_CONNECTION_UPDATE_RESP_VSEVT_CODE:
        {
          aci_l2cap_connection_update_resp_event_rp0 *p_l2cap_conn_update_resp;
          p_l2cap_conn_update_resp = (aci_l2cap_connection_update_resp_event_rp0 *) p_blecore_evt->data;
          UNUSED(p_l2cap_conn_update_resp);
        }
        break;
      case ACI_GAP_PROC_COMPLETE_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PROC_COMPLETE_VSEVT_CODE\n");
          aci_gap_proc_complete_event_rp0 *p_gap_proc_complete;
          p_gap_proc_complete = (aci_gap_proc_complete_event_rp0*) p_blecore_evt->data;
          UNUSED(p_gap_proc_complete);
        }
        break;
      case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
        break;
      case ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_KEYPRESS_NOTIFICATION_VSEVT_CODE\n");
        }
        break;
      case ACI_GAP_PASSKEY_REQ_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PASSKEY_REQ_VSEVT_CODE\n");

          ret = aci_gap_passkey_resp(bleAppCtx.BleApplicationContext_legacy.connectionHandle, CFG_FIXED_PIN);
          if (ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Fail, reason: 0x%02X\n", ret);
          }
          else
          {
            APP_DBG_MSG("==>> aci_gap_passkey_resp : Success\n");
          }
        }
        break;
      case ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE:
        {
          APP_DBG_MSG(">>== ACI_GAP_PAIRING_COMPLETE_VSEVT_CODE\n");
          aci_gap_pairing_complete_event_rp0 *p_pairing_complete;
          p_pairing_complete = (aci_gap_pairing_complete_event_rp0*)p_blecore_evt->data;

          if (p_pairing_complete->Status != 0)
          {
            APP_DBG_MSG("     - Pairing KO\n     - Status: 0x%02X\n     - Reason: 0x%02X\n",
                        p_pairing_complete->Status, p_pairing_complete->Reason);
          }
          else
          {
            APP_DBG_MSG("     - Pairing Success\n");
          }
          APP_DBG_MSG("\n");
        }
        break;
      case ACI_GATT_SRV_READ_VSEVT_CODE :
        {
          APP_DBG_MSG(">>== ACI_GATT_SRV_READ_VSEVT_CODE\n");

          aci_gatt_srv_read_event_rp0    *p_read;
          p_read = (aci_gatt_srv_read_event_rp0*)p_blecore_evt->data;
          uint8_t error_code = BLE_ATT_ERR_INSUFF_AUTHORIZATION;

          APP_DBG_MSG("Handle 0x%04X\n",  p_read->Attribute_Handle);

          error_code =  BLE_ATT_ERR_NONE;

          aci_gatt_srv_resp(p_read->Connection_Handle,
                            p_read->CID,
                            p_read->Attribute_Handle,
                            error_code,
                            0,
                            NULL);
          break;
        }

      	case ACI_GATT_SRV_ATTRIBUTE_MODIFIED_VSEVT_CODE:
            {
          	  APP_DBG_MSG(">>== ACI_GATT_SRV_ATTRIBUTE_MODIFIED_VSEVT_CODE\n");
          	  aci_gatt_srv_attribute_modified_event_rp0 *p_attr_mod;
          	  p_attr_mod = (aci_gatt_srv_attribute_modified_event_rp0*)p_blecore_evt->data;

          	  Landslide_Service_AttributeModified(p_attr_mod->Attr_Handle,
          			  	  	  	  	  	  	  	  p_attr_mod->Attr_Data,
      											  p_attr_mod->Attr_Data_Length);
            }
           break;

      default:
        break;
      }
    }
    break;

  case HCI_HARDWARE_ERROR_EVT_CODE:
    {
      hci_hardware_error_event_rp0 *p_hci_hardware_error_event;
      p_hci_hardware_error_event = (hci_hardware_error_event_rp0*)p_event_pckt->data;

      if (p_hci_hardware_error_event->Hardware_Code <= 0x03)
      {
    	 SEGGER_RTT_printf(0, "!!! HCI HARDWARE ERROR code=0x%02X -- resetting\n",
    	                    p_hci_hardware_error_event->Hardware_Code);
        NVIC_SystemReset();
      }
    }
    break;

  default:
    break;
  }
}

static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout)
{
  if(Status != 0)
  {
    APP_DBG_MSG("==>> connection_complete_event Fail, Status: 0x%02X\n", Status);
    bleAppCtx.Device_Connection_Status = APP_BLE_IDLE;
    return;
  }

  APP_DBG_MSG(">>== hci_le_connection_complete_event - Connection handle: 0x%04X\n", Connection_Handle);
  APP_DBG_MSG("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
              Peer_Address[5],
              Peer_Address[4],
              Peer_Address[3],
              Peer_Address[2],
              Peer_Address[1],
              Peer_Address[0]);
  APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n",
              INT(Connection_Interval*1.25),
              FRACTIONAL_2DIGITS(Connection_Interval*1.25),
              Peripheral_Latency,
              Supervision_Timeout * 10
              );

  SEGGER_RTT_printf(0, "[Conn] interval=%d.%02d ms  latency=%d  supervision=%d ms\n",
                        INT(Connection_Interval*1.25),
                        FRACTIONAL_2DIGITS(Connection_Interval*1.25),
                        Peripheral_Latency,
                        Supervision_Timeout * 10);

  if (bleAppCtx.Device_Connection_Status == APP_BLE_LP_CONNECTING)
  {
    bleAppCtx.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
  }
  else
  {
    bleAppCtx.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
  }
  bleAppCtx.BleApplicationContext_legacy.connectionHandle = Connection_Handle;

  Landslide_Service_ConnectionComplete(Connection_Handle);

  /* Send current state immediately to newly connected client */
  float vel = tilt_detector_get_rate_dph();
  float dev = tilt_detector_get_deviation();

  uint16_t vel_x100_16 = (uint16_t)(vel * 100.0f + 0.5f);
  uint16_t dev_x100_16 = (uint16_t)(dev * 100.0f + 0.5f);

  Landslide_Update_Alert_Status((uint8_t)tilt_detector_get_state(), tilt_detector_get_trigger_reason());
  Landslide_Update_Tilt_Data(dev_x100_16, vel_x100_16);

